FemDesign.Releases.Rotations.#ctor
Parameterless constructor for serialization.

FemDesign.Releases.Rotations.#ctor(System.Double,System.Double,System.Double,System.Double,System.Double,System.Double)
Private constructor [kNm/rad or kNm/m/rad].
xNeg: Cx' compression.
xPos: Cx' tension.
yNeg: Cy' compression.
yPos: Cy' tension.
zNeg: Cz' compression.
zPos: Cz' tension.

FemDesign.Releases.Rotations.Define(System.Double,System.Double,System.Double,System.Double,System.Double,System.Double)
Define a new rotations release [kNm/rad or kNm/m/rad].
Remarks: Create
xNeg: Cx' compression [kNm/rad or kNm/m/rad].
xPos: Cx' tension [kNm/rad or kNm/m/rad].
yNeg: Cy' compression [kNm/rad or kNm/m/rad].
yPos: Cy' tension [kNm/rad or kNm/m/rad].
zNeg: Cz' compression [kNm/rad or kNm/m/rad].
zPos: Cz' tension [kNm/rad or kNm/m/rad].

FemDesign.Releases.Rotations.RigidPoint
Define a rigid rotations release for a point-type release (1e+10 kNm/rad).

FemDesign.Releases.Rotations.RigidLine
Define a rigid rotations release for a line-type release (1e+07 kNm/m/rad).

FemDesign.Releases.Rotations.Free
Define a free rotations release.